{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 3, 24], "mask_value": -1, "name": "masking_1", "dtype": "float32", "trainable": true}, "class_name": "Masking"}, {"config": {"units": 32, "dtype": "float32", "activation": "tanh", "batch_input_shape": [null, 3, 24], "go_backwards": false, "implementation": 1, "unit_forget_bias": true, "kernel_constraint": null, "name": "lstm_1", "trainable": true, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "unroll": false, "return_sequences": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.2, "recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "stateful": false}, "class_name": "LSTM"}, {"config": {"use_bias": true, "units": 13, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "batch_input_shape": [null, 32], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}